<?php
// 반복문을 이용해서 1~10까지 숫자를 출력해 주세요.



// for($i = 1; $i <= 10; $i++) {
// 	echo "$i\n";

// }

// 구구단 2단을 반복문을 이용해서 작성해 주세요
// 2 x 1 = 2

// for ($i = 1; $i < 10; $i++)
// {
// 	 	if($i%2 === 1 ) {			
// 			continue;
// 		}
// 	echo "$i 단\n";
//     for ($j = 1; $j < 10; $j++) {
//     {
//         echo "$i x $j = " ,$i*$j, "\n";
//     }
// 	}
// }


// 구구단 2단을 반복문을 이용해서 작성해 주세요.
// for ($i = 1; $i <=9; $i++) {
// 	$mul = $i * 2;
// 	echo "2 x {$i} = {$mul}\n";
// }



// *
// **
// ***
// ****
// *****
// for($i=0; $i<=5; $i++){
// 	for($j=0;$j<=5; $j++){
// 			if($j<$i){
// 			echo "*";
// 		}
		
// 	}
// 	echo"\n";
// }


     
// *
// **
// ***
// ****
// *****
// for($i=0; $i<=5; $i++) {
// 	for($j=5; $j>0; $j--) {
// 		if($j>$i){
// 			echo " ";
// 		}
// 		else { 
// 			echo "*";
// 		}
// 	}
// 	echo "\n";
// }


// *****
//  ****
//   ***
//    **
//     *

// for($i=0; $i<=5; $i++){
// 	for($j=0;$j<5; $j++){
// 		if($j<$i){
// 			echo " ";
// 		}
// 		else{
// 			echo "*";
// 	}
// 	}
// 	echo"\n";
// }

//마름모


for($i = 1; $i <= 5; $i++) {
	for($j = 1; $j<=5 - $i; $j++) {
		echo " ";
	}
	for($j = 1; $j <= 2*$i - 1; $j++) {
		echo "*";
	}
	echo "\n";
}
for($i = 4; $i >= 1; $i--) {
	for($j = 1; $j<=5 - $i; $j++) {
		echo " ";
	}
	for($j =1; $j <= 2*$i - 1; $j++) {
		echo "*";
	}
	echo "\n";
}


